// Указание вершин (и буфера(ов)) и настройка вершинных атрибутов
float vertices[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   0.33f, 1.0f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   0.33f, 0.75f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.0f, 0.75f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.0f, 1.0f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   0.33f, 1.0f,
                -0.5f, -0.5f, 0.0f,   0.0f, 0.75f
        };

float vertices2[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   0.67f, 1.0f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   0.67f, 0.75f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.33f, 0.75f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.33f, 1.0f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   0.67f, 1.0f,
                -0.5f, -0.5f, 0.0f,   0.33f, 0.75f
        };

float vertices3[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   1.0f, 1.0f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   1.0f, 0.75f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.67f, 0.75f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.67f, 1.0f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   1.0f, 1.0f,
                -0.5f, -0.5f, 0.0f,   0.67f, 0.75f
        };

float vertices4[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   0.33f, 0.75f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   0.33f, 0.5f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.0f, 0.5f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.0f, 0.75f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   0.33f, 0.75f,
                -0.5f, -0.5f, 0.0f,   0.0f, 0.5f
        };

float vertices5[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   0.67f, 0.75f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   0.67f, 0.5f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.33f, 0.5f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.33f, 0.75f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   0.67f, 0.75f,
                -0.5f, -0.5f, 0.0f,   0.33f, 0.5f
        };

float vertices6[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   1.0f, 0.75f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   1.0f, 0.5f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.67f, 0.5f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.67f, 0.75f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   1.0f, 0.75f,
                -0.5f, -0.5f, 0.0f,   0.67f, 0.5f
        };

float vertices7[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   0.33f, 0.5f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   0.33f, 0.25f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.0f, 0.25f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.0f, 0.5f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   0.33f, 0.5f,
                -0.5f, -0.5f, 0.0f,   0.0f, 0.25f
        };

float vertices8[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   0.67f, 0.5f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   0.67f, 0.25f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.33f, 0.25f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.33f, 0.5f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   0.67f, 0.5f,
                -0.5f, -0.5f, 0.0f,   0.33f, 0.25f
        };

float vertices9[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   1.0f, 0.5f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   1.0f, 0.25f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.67f, 0.25f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.67f, 0.5f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   1.0f, 0.5f,
                -0.5f, -0.5f, 0.0f,   0.67f, 0.25f
        };

float vertices10[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   0.33f, 0.25f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   0.33f, 0.0f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.0f, 0.0f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.0f, 0.25f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   0.33f, 0.25f,
                -0.5f, -0.5f, 0.0f,   0.0f, 0.0f
        };

float vertices11[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   0.67f, 0.25f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   0.67f, 0.0f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.33f, 0.0f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.33f, 0.25f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   0.67f, 0.25f,
                -0.5f, -0.5f, 0.0f,   0.33f, 0.0f
        };

float vertices12[] =
        {
                // координаты        // текстурные координаты
                0.5f,  0.5f, 0.0f,   1.0f, 0.25f, // верхняя правая вершина
                0.5f, -0.5f, 0.0f,   1.0f, 0.0f, // нижняя правая вершина
                -0.5f, -0.5f, 0.0f,   0.67f, 0.0f, // нижняя левая вершина
                -0.5f,  0.5f, 0.0f,   0.67f, 0.25f,  // верхняя левая вершина
                0.5f,  0.5f, 0.0f,   1.0f, 0.25f,
                -0.5f, -0.5f, 0.0f,   0.67f, 0.0f
        };

int Vertices_Size = sizeof(vertices);
